<template>  
    <head>
        <meta name="robots" content="noindex, nofollow">
    </head>
    <div class=" privacy_policy center">        
        <h2 class="privacy_policy-title">Политика конфиденциальности</h2>
        <p class="privacy_policy-text" >Мы получаем и собираем информацию, которую вы вводите на нашем сайте или предоставляете нам любым другим способом. Мы используем программные инструменты для измерения и сбора информации о сеансе, включая время отклика страницы, продолжительность посещений определенных страниц, информацию о взаимодействии со страницей и методы, используемые для просмотра информации вне страницы. Мы также собираем личную информацию (включая имя, номер телефона, каналы связи), а также ваши сообщения нам.</p>
        <router-link class="page404__btn in_center" :to="'/'">&#8592; На Главную
</router-link>
        <h3 class="privacy_policy-subtitle">Как мы собираем информацию</h3>
        <p class="privacy_policy-text">Когда вы вводите данные в поля формы на нашем сайте, мы собираем личную информацию, которую вы предоставляете нам, такую как ваше имя, номер телефона, сообщение. Ваша личная информация будет использована только для указанных ниже целей.</p>
        <h3 class="privacy_policy-subtitle">Почему мы собираем персональные данные</h3>
        <p class="privacy_policy-text">Мы собираем персональные данные для консультации по услугам, возможности связи с Вами по интересующим вопросам, а также для соблюдения применимых законов и регламентов.</p>
        <h3 class="privacy_policy-subtitle">Как хранятся персональные данные</h3>
        <p class="privacy_policy-text">Персональные данные поступают в наш чат Телеграм. После консультирования данные чата очищаются</p>
        <h3 class="privacy_policy-subtitle">Как мы общаемся с поситителями сайта</h3>
        <p class="privacy_policy-text">По данным из формы обратной связи или при обращении через мессенджеры мы можем написать вам либо перезвонить для оказания консультации</p>
        <h3 class="privacy_policy-subtitle">Как отозвать свое согласие на обработку данных</h3>
        <p class="privacy_policy-text">Если вы больше не хотите, чтобы мы обрабатывали ваши данные, напишите нам по адресу <a href="mailto:yulyakam85@mail.ru" class="footer__link" title="Написать на email">yulyakam85@mail.ru</a> или отправьте нам письмо по адресу: 350032 г.Краснодар СНТ Авиатор 15км Ростовского шоссе Вишневая 74.</p>
        <h3 class="privacy_policy-subtitle">Обновления политики конфиденциальности</h3>
        <p class="privacy_policy-text">Мы оставляем за собой право изменять эту политику конфиденциальности в любое время, поэтому вам следует регулярно ее просматривать. Изменения и пояснения вступают в силу сразу же после их публикации на сайте. Если мы внесем в эту политику существенные изменения, мы сообщим вам об обновлении политики, чтобы вы знали, какую информацию мы собираем, как мы ее используем и при каких обстоятельствах мы передаем ее третьим лицам.</p>
        <h3 class="privacy_policy-subtitle">Вопросы и контактная информация</h3>
        <p class="privacy_policy-text">Если вы хотите получить доступ, исправить, изменить или удалить любую имеющуюся у нас личную информацию, вы можете написать нам по адресу  <a href="mailto:yulyakam85@mail.ru" class="footer__link" title="Написать на email">yulyakam85@mail.ru</a> или отправить нам письмо по адресу: 350032 г.Краснодар СНТ Авиатор 15км Ростовского шоссе Вишневая 74.</p> 
        <router-link class="page404__btn in_center" :to="'/'">&#8592; На Главную
</router-link>       
    </div>
    
</template>

<script>
    export default {
        name: "privacyPolicy",
    }
</script>

