<template>
     <HeaderComp />
   <main class="content">        
    <section class="service_group center" >
      <h2 class="service_group_name" id="card1">Работы с блоком
        цилиндров</h2>
      <p class="service_group_text">В нашей мастерской представлен широкий спектор услуг, связанных с ремонтом Блока цилиндров. Для начала работ происходит обследование блока цилиндров на наличие трещин, износа или других повреждений. Наиболее часто встречаемый деффект - выработка в цилиндрах.</p>  
      <p class="service_group_text">Возможные работы, детальное описание и стоимость в карточках ниже</p>
<h2 style="margin-bottom: 20px">Осуществим расточку цилиндров диаметром от 75мм</h2>
<span class="service_group_text">Остались вопросы? Звоните: </span>
      <svg  xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 512 512"><path fill ='#000000' d="M280 0C408.1 0 512 103.9 512 232c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-101.6-82.4-184-184-184c-13.3 0-24-10.7-24-24s10.7-24 24-24zm8 192a32 32 0 1 1 0 64 32 32 0 1 1 0-64zm-32-72c0-13.3 10.7-24 24-24c75.1 0 136 60.9 136 136c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-48.6-39.4-88-88-88c-13.3 0-24-10.7-24-24zM117.5 1.4c19.4-5.3 39.7 4.6 47.4 23.2l40 96c6.8 16.3 2.1 35.2-11.6 46.3L144 207.3c33.3 70.4 90.3 127.4 160.7 160.7L345 318.7c11.2-13.7 30-18.4 46.3-11.6l96 40c18.6 7.7 28.5 28 23.2 47.4l-24 88C481.8 499.9 466 512 448 512C200.6 512 0 311.4 0 64C0 46 12.1 30.2 29.5 25.4l88-24z"/>
      </svg>
        <a href="tel:+79601039766" title="Позвонить на 8 960 103 97 66" class="map__info_text" style="color: black;">8 960 103 97 66</a>
      <div class="card">
            <article class="card_item" v-for="(card, index) in cardsByBlog" :key="index">
              <img :src="card.img" alt="" class="card_img" />
              <h2 class="card_subtitle">{{ card.title }}</h2>
              <p class="card_text"> {{ card.text }} </p>
              <span class="cost">Цена: от {{ card.price }}</span>                             
            </article>
        </div>  
        <a class="card_subtitle-link more" href="https://suprotec.ru/suprotek-rastochka-cilindrov-v-dvigatele" title="Почитать интересное на тему">
                    Узнать больше о процедуре &#8594
                </a> 
    </section>

    <section class="service_group center" >
      <h2 class="service_group_name" id="card2">Работы с колен.
        валом</h2>
        <p class="service_group_text">Услуги по части ремонта коленчатого вала представлены рядом работ, связанных с осмотром коленчатого вала на наличие выработки или других повреждений. Наиболее часто встречаемый деффект - выработка на шейках вала и как следствие потеря давления масла.</p>  
      <p class="service_group_text">Возможные работы, детальное описание и стоимость в карточках ниже</p>
      <span class="service_group_text">Остались вопросы? Звоните: </span>
      <svg  xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 512 512"><path fill ='#000000' d="M280 0C408.1 0 512 103.9 512 232c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-101.6-82.4-184-184-184c-13.3 0-24-10.7-24-24s10.7-24 24-24zm8 192a32 32 0 1 1 0 64 32 32 0 1 1 0-64zm-32-72c0-13.3 10.7-24 24-24c75.1 0 136 60.9 136 136c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-48.6-39.4-88-88-88c-13.3 0-24-10.7-24-24zM117.5 1.4c19.4-5.3 39.7 4.6 47.4 23.2l40 96c6.8 16.3 2.1 35.2-11.6 46.3L144 207.3c33.3 70.4 90.3 127.4 160.7 160.7L345 318.7c11.2-13.7 30-18.4 46.3-11.6l96 40c18.6 7.7 28.5 28 23.2 47.4l-24 88C481.8 499.9 466 512 448 512C200.6 512 0 311.4 0 64C0 46 12.1 30.2 29.5 25.4l88-24z"/></svg>
        <a href="tel:+79601039766" title="Позвонить на 8 960 103 97 66" class="map__info_text" style="color: black;">8 960 103 97 66</a>
      <div class="card">
            <article class="card_item" v-for="(card, index) in cardsByShaft" :key="index">
              <img :src="card.img" alt="" class="card_img" />
              <h2 class="card_subtitle">{{ card.title }}</h2>
              <p class="card_text"> {{ card.text }} </p>
              <span class="cost">Цена: от {{ card.price }}</span>                               
            </article>
        </div>
        <a class="card_subtitle-link more" href="https://www.dieselmotors-spb.ru/informatsiya/kak-shlifuyut-kolenvaly.html" title="Почитать интересное на тему">
                    Узнать больше о процедуре &#8594
                </a> 
      </section>
  
      <section class="service_group center" >
      <h2 class="service_group_name" id="card3">Токарные
            работы</h2>
        <p class="service_group_text">Спектр токарных работ включает в себя широкий набор процессов, которые можно выполнить на токарном станке. Это может включать изготовление деталей, проведение различных операций обработки металла и создание отдельных элементов для механизмов.</p>  
      <p class="service_group_text">Возможные работы, детальное описание и стоимость в карточках ниже</p>
      <span class="service_group_text">Остались вопросы? Звоните: </span>
      <svg  xmlns="http://www.w3.org/2000/svg" height="1em" viewBox="0 0 512 512"><path fill ='#000000' d="M280 0C408.1 0 512 103.9 512 232c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-101.6-82.4-184-184-184c-13.3 0-24-10.7-24-24s10.7-24 24-24zm8 192a32 32 0 1 1 0 64 32 32 0 1 1 0-64zm-32-72c0-13.3 10.7-24 24-24c75.1 0 136 60.9 136 136c0 13.3-10.7 24-24 24s-24-10.7-24-24c0-48.6-39.4-88-88-88c-13.3 0-24-10.7-24-24zM117.5 1.4c19.4-5.3 39.7 4.6 47.4 23.2l40 96c6.8 16.3 2.1 35.2-11.6 46.3L144 207.3c33.3 70.4 90.3 127.4 160.7 160.7L345 318.7c11.2-13.7 30-18.4 46.3-11.6l96 40c18.6 7.7 28.5 28 23.2 47.4l-24 88C481.8 499.9 466 512 448 512C200.6 512 0 311.4 0 64C0 46 12.1 30.2 29.5 25.4l88-24z"/></svg>
        <a href="tel:+79601039766" title="Позвонить на 8 960 103 97 66" class="map__info_text" style="color: black;">8 960 103 97 66</a>
      <div class="card">
            <article class="card_item" v-for="(card, index) in  cardsByTurningWorks" :key="index">
              <img :src="card.img" alt="" class="card_img" />
              <h2 class="card_subtitle">{{ card.title }}</h2>
              <p class="card_text"> {{ card.text }} </p>
              <span class="cost">Цена: от {{ card.price }}</span>                               
            </article>
        </div>
        <a class="card_subtitle-link more" href="https://www.stankoff.ru/blog/post/566" title="Почитать интересное на тему">
                    Узнать больше о процедуре &#8594
                </a> 
      </section>       
      
        </main>
        <FuterComp />      
</template>
<script>
import HeaderComp from '@/components/HeaderComp.vue';
import FuterComp from '@/components/FuterComp.vue';

export default {
  name: 'Contact',
  data() {
    return {
      cardsByBlog: [
                {                     
                    title: 'Расточка блока цилиндров',
                    img: require("@/assets/images/boring.jpeg"),
                    text: 'Расточка гильз блока цилиндров — это процесс удаления небольшого слоя металла из внутренней поверхности цилиндров, чтобы восстановить правильные размеры и форму, в случае износа цилиндров или других повреждений. Расточка может проводиться специальными инструментами под определенные размеры и допуски, для установки новых поршней и поршневых колец, обеспечивая правильный зазор и хорошее сцепление во время работы двигателя.Важно, чтобы расточка проводилась с высокой точностью, чтобы обеспечить оптимальную работу двигателя и долговечность новых деталей.',
                    price: 2000,
                },
                {  
                    title: 'Хонинговка блока цилиндров',
                    img: require("@/assets/images/honing.jpg"),
                    text: 'Хонинговка блока цилиндров представляет собой процесс обработки внутренней поверхности цилиндров для придания им определенной текстуры. Этот процесс может быть выполнен специальным инструментом под названием хон или дабл-хон, который придает цилиндрам определенный шероховатый рельеф. Формирование оптимальной поверхностной текстуры улучшает смазку, удерживает масло и обеспечивает правильную работу поршневых колец, что в свою очередь повышает эффективное уплотнение и снижает износ.',
                    price: 1000,
                },
                {   
                    title: 'Фрезеровка плоскости блока цилиндров',
                    img: require("@/assets/images/milling.jpg"),
                    text: 'Фрезеровка плоскости блока цилиндров - процедура обработки верхней горизонтальной плоскости блока цилиндров. Процесс может выполняться для того, чтобы обеспечить ровность поверхности, на которую будет устанавливаться головка блока цилиндров, дабы сохранить правильную геометрию и размеры. Фрезеровка может быть необходима для устранения неровностей, плоскостных ошибок или повреждений, которые могут возникнуть в процессе эксплуатации автомобиля. Важно, чтобы плоскость блока цилиндров была равномерной и герметичной. Это обеспечит надлежащее уплотнение между блоком цилиндров и головкой цилиндров, что в свою очередь защитит двигатель от гидроудара.',
                    price: 1000,
                },
            ],
      cardsByTurningWorks: [
      {                    
                    
                    title: 'Изготовление деталей',
                    img: require("@/assets/images/production.jpg"),
                    text: 'Наиболее восстребованными работами являются различные резьбовые соединения: гайки и болты разных диаметров и резьб. Крепежные детали: винты, шпильки, шплинты и другие элементы.',
                    price: 200,
                },
                {                
                    
                    title: 'Проточка тормозных дисков',
                    img: require("@/assets/images/crankshaft.jpg"),
                    text: 'Токарный станок способен восстановить целосность и ровность поверхности тормозных дисков, маховиков. В рамках этой операции осуществляется подрезка поршней с целью увеличения камеры сгорания. Обработка поверхности гильз для достижения необходимого размера. И многое другое',
                    price: 1000,
                },
                {            
                   
                    title: 'Восстановительные работы',
                    img: require("@/assets/images/recovery.jpg"),
                    text: 'Токарный станок позволяет выполнять разнообразные операции обработки металла. К сожалению при эксплуатации деталей происходит износ поверхности, что приводит к выработке отверстий. Решение: расточка и завтуливание. Не менее частой проблемой является и нарушение резьбы, облом шпилек и болтов при выкручивании. Восстановительные работы в этом случае заключаются в завтуливании и нарезке новой резьбы',
                    price: 500,
                },    
                
      ],
      cardsByShaft: [
      { 
                    title: 'Шлифовка коленчатого вала',
                    img: require("@/assets/images/grinding.jpg"),
                    text: 'Шлифовка коленчатого вала представляет собой процесс приведения коленчатого вала к определенным размерам и геометрическим параметрам. Размер устанавливается по каталогу, а также после контрольных измерений шатунов. В ходе шлифовки, поверхность вала обрабатывается с помощью специализированных абразивных инструментов (шлифовальный круг), чтобы получить требуемую гладкость и точные размеры. Перед шлифовкой коленчатого вала необходимо убедится в соосности его шеек. Соосность может быть нарушена в связи со стуком двигателя. При наличае ассиметрии происходит выравнивание. Следующим этапом после шлифовки может быть полировка. Полировка поверхности коленчатого вала делает его гладким и блестящим, создавая оптимальные условия для правильной  и долговечной работы двигателя.',
                    price: 2000,
                },
                { 
                    title: 'Восстановление разбега коленчатого вала',
                    img: require("@/assets/images/crankshaft.jpg"),
                    text: 'Восстановление разбега (или зазора) на коленчатом валу может быть сложной процедурой. Первым шагом является измерение текущего состояния коленчатого вала, чтобы определить величину износа. Если разбег превышает допустимые пределы возврат к первоначальному состоянию производится техникой наплавки. После восстановления потерянного металла на поверхности коленчатого вала проводится нарезание, чтобы восстановить правильную геометрию. После ремонтных работ, поверхность коленчатого вала полируется, проводится контроль с помощью специальных измерительных инструментов, чтобы удостовериться, что размеры и зазоры соответствуют требуемым спецификациям.Важно отметить, что данный процесс требует специализированного оборудования, опытных специалистов и строгого соблюдения технологических процессов.',
                    price: 1000,
                },
                {   
                    title: 'Балансировка коленчатого вала с маховиком',
                    img: require("@/assets/images/turning-works.jpg"),
                    text: 'Балансировка коленчатого вала с маховиком – важный критерий, который необходим для обеспечения плавности и равномерности работы двигателя.Коленчатый вал и маховик в сборе с корзиной устанавливаются на специальных балансировочных роликах, что позволяет определить точные места, где присутствует дисбаланс на коленчатом валу. После определения места дисбаланса, проводится коррекция. Это может включать удаление материала, сварку или добавление грузиков для достижения баланса. После коррекции проводится повторное измерение.',
                    price: 500,
                },     
      ]
    }
  },
  components: {
    HeaderComp,
    FuterComp,
    
}

}

</script>